//---------------------------------------------------------
// 
//	iruna_model_loader.h
//	指定したモデルデータ読み込み
//	作成日 10月21日
//	製作者 立川 翔野
// 
//---------------------------------------------------------
#ifndef IRUNA_MODEL_LOADER_H
#define IRUNA_MODEL_LOADER_H

/*----インクルード------------------------------------------------*/
#include "../Include/iruna_utility.h"
#include "../Include/iruna_model_data.h"

namespace iruna
{
namespace graphics
{

/*----前方宣言------------------------------------------------*/
class	ModelDecoder;


//=====================================================================
//
//	クラス名	:	ModelLoader
//	処理		:	指定したモデルデータ読み込み
//	製作者		:	立川 翔野
//	作成日		:	2011/10/21	- 作成
//
//=====================================================================
class ModelLoader
{
private:

	ModelDecoder* loader;

public:
	//--------------------------------------------------------------------
	// 
	//	処理	:	コンストラクタ
	//	製作者	:	立川 翔野
	//	作成日	:	2011/10/21	- 作成
	// 
	//--------------------------------------------------------------------
	ModelLoader();

	//--------------------------------------------------------------------
	// 
	//	処理	:	デストラクタ
	//	製作者	:	立川 翔野
	//	作成日	:	2011/10/21	- 作成
	// 
	//--------------------------------------------------------------------
	~ModelLoader();

	//--------------------------------------------------------------------
	// 
	//	処理	:	解放処理
	//	製作者	:	立川 翔野
	//	作成日	:	2011/10/21	- 作成
	// 
	//--------------------------------------------------------------------
	void Relese();

	//--------------------------------------------------------------------
	// 
	//	処理	:	指定したモデル
	//	第1引数	:	[in] in_path	-	指定されたパス
	//	第2引数	:	[in] in_flame	-	読み込むアニメーションフレーム
	//	戻り値	:	結果フラグ	true : 成功 false : 失敗
	//	製作者	:	立川 翔野
	//	作成日	:	2011/10/21	- 作成
	// 
	//--------------------------------------------------------------------
	bool Load( std::string in_path, int in_flame );

	//--------------------------------------------------------------------
	// 
	//	処理	:	読み込んだモデルデータの取得
	//	戻り値	:	読み込んだファイルデータ
	//	製作者	:	立川 翔野
	//	作成日	:	2011/10/21	- 作成
	// 
	//--------------------------------------------------------------------
	ModelData* GetModelData();

};

}	//	graphics	end
}	//	iruna		end


#endif	//	IRUNA_MODEL_LOADER_H	end