//---------------------------------------------------------
// 
//	diaolg_animetion_input.h
//	アニメーションフレームをセットするダイアログの管理
//	作成日 1月5日
//	製作者 立川 翔野
// 
//---------------------------------------------------------
/*----多重インクルード防止-------------------------------------------------*/
#ifndef DIALOG_ANIMETION_INPUT_H
#define DIALOG_ANIMETION_INPUT_H

/*----インクルード-------------------------------------------------*/
#include "../../iruna/Include/iruna.h"

/*----ネームスペース-------------------------------------------------*/
using namespace iruna;
using namespace	graphics;
using namespace	io;

//=====================================================================
//
//	クラス名	:	AnimetionInput
//	処理		:	アニメーションフレームを設定するダイアログ管理クラス
//
//=====================================================================
class AnimetionInput
{
//	プライベートメンバ変数
private:

	HWND						dialog;
	HWND						animetionSet;

//	プライベートメンバ	関数
private:

	static LRESULT CALLBACK		Procedure( HWND hWnd, UINT msg, WPARAM wParam, LPARAM lParam );

//	パブリックメンバ	関数
public:

	//--------------------------------------------------------------------
	// 
	//	処理	:	コンストラクタ
	// 
	//--------------------------------------------------------------------
	AnimetionInput();

	//--------------------------------------------------------------------
	// 
	//	処理	:	デストラクタ
	// 
	//--------------------------------------------------------------------
	~AnimetionInput();

	//--------------------------------------------------------------------
	// 
	//	処理	:	初期化
	//	戻り値	:	結果フラグ　-1	:	ダイアログウインドウの生成に失敗
	// 
	//--------------------------------------------------------------------
	int Init();

	//--------------------------------------------------------------------
	// 
	//	処理	:	インプットダイアログの解放
	// 
	//--------------------------------------------------------------------
	void Relese();

	//--------------------------------------------------------------------
	// 
	//	処理	:	ダイアログの更新
	// 
	//--------------------------------------------------------------------
	void Show() const;

	//--------------------------------------------------------------------
	// 
	//	処理	:	ダイアログが書き込む値を設定する
	//	第1引数 :	ダイアログに設定するフレーム
	// 
	//--------------------------------------------------------------------
	void SetAnimetionFlame( int animetionFlame );

	//--------------------------------------------------------------------
	// 
	//	処理	:	ユーザーが設定したアニメーションの値を取得する
	//	戻り値	:	ユーザーが入力した値
	// 
	//--------------------------------------------------------------------
	int GetAnimetionFlame() const;

};

#endif	//	DIALOG_ANIMETION_INPUT_H	end