//---------------------------------------------------------
// 
//	iruna_sound_device.h
//	Xaudio2の初期化と管理
//	作成日 7月9日
//	製作者 立川 翔野
// 
//---------------------------------------------------------

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_SOUND_DEVICE_H
#define IRUNA_SOUND_DEVICE_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"


/*----データ型宣言-------------------------------------------------*/
namespace iruna
{
namespace sound
{

//=====================================================================
//
//	クラス名	:	SoundDevice
//	処理		:	Xaudio2の初期化と管理
//	製作者		:	立川 翔野
//	作成日		:	2011/07/9	- 作成
//
//=====================================================================
class SoundDevice
{
private:

	static IXAudio2*					xAudio;			// Xaudio2のポインタ
	static IXAudio2MasteringVoice*		masterVoice;	// XAudio2MasteringVoiceのポインタ

public:
	//--------------------------------------------------------------------
	// 
	//	処理	:	コンストラクタ
	//	製作者	:	立川 翔野
	//	作成日	:	2011/07/9	- 作成
	// 
	//--------------------------------------------------------------------
	SoundDevice();

	//--------------------------------------------------------------------
	// 
	//	処理	:	デストラクタ
	//	製作者	:	立川 翔野
	//	作成日	:	2011/07/9	- 作成
	// 
	//--------------------------------------------------------------------
	~SoundDevice();

	//--------------------------------------------------------------------
	// 
	//	処理	:	Xaudio2を作成する
	//	製作者	:	立川 翔野
	//	作成日	:	2011/07/9	- 作成
	// 
	//--------------------------------------------------------------------
	int CreateSoundDevice( U_INT speakers );

	//--------------------------------------------------------------------
	// 
	//	処理	:	作成したIXAudio2を解放する
	//	製作者	:	立川 翔野
	//	作成日	:	2011/07/9	- 作成
	// 
	//--------------------------------------------------------------------
	void ReleaseSoundDevice();

	//--------------------------------------------------------------------
	// 
	//	処理	:	作成したIXAudio2のインスタンスを取得する
	//	製作者	:	立川 翔野
	//	作成日	:	2011/07/9	- 作成
	// 
	//--------------------------------------------------------------------
	static IXAudio2* GetDevice();

	//--------------------------------------------------------------------
	// 
	//	処理	:	作成したIXAudio2MasteringVoiceのインスタンスを取得する
	//	製作者	:	立川 翔野
	//	作成日	:	2011/07/9	- 作成
	// 
	//--------------------------------------------------------------------
	static IXAudio2MasteringVoice* GetMasteringVoice();


};

}	//	sound	end
}	//	iruna	end

#endif	//	IRUNA_SOUND_DEVICE_H